hotelsBPELApp/test/testGetHotels/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:hot="http://hotelsBPEL_WSDL">
  <soapenv:Body>
    <hot:getHotelsRequest>
      <city>Lyngby</city>
      <arrivalDate>2008-09-29</arrivalDate>
      <departureDate>2014-09-19</departureDate>
    </hot:getHotelsRequest>
  </soapenv:Body>
</soapenv:Envelope>